tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "bash"
brew "bash-completion@2"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "findutils"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "grc"
brew "grep"
brew "htop"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "lnav"
brew "make"
brew "micro"
brew "minikube"
brew "node"
brew "openssh"
brew "openssl@1.1"
brew "protobuf"
brew "python@3.9"
brew "ruby"
brew "subversion"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

cask "alfred"
cask "cleanmymac"
cask "docker"
cask "evernote"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "google-backup-and-sync"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "keka"
cask "mpv"
cask "rectangle"
cask "qlmarkdown"
cask "quicklook-json"
cask "postman"
cask "tomighty"
cask "transmission"
cask "typora"
cask "visual-studio-code"
cask "xld"
