tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "ag"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "buf"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "dotnet-sdk"
brew "duf"
brew "dust"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gping"
brew "graphviz"
brew "grc"
brew "htop"
brew "ipcalc"
brew "jq"
brew "lnav"
brew "make"
brew "micro"
brew "minikube"
brew "node"
brew "openssh"
brew "openssl@1.1"
brew "procs"
brew "protobuf"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "sd"
brew "subversion"
brew "tldr"
brew "tree"
brew "xh"

cask "brave-browser"
cask "cleanmymac"
cask "docker"
cask "evernote"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-source-code-pro"
cask "goland"
cask "google-drive"
cask "google-chrome"
cask "iterm2"
cask "keka"
cask "mpv"
cask "notion"
cask "obsidian"
cask "qlmarkdown"
cask "quicklook-json"
cask "pdf-expert"
cask "postman"
cask "raycast"
cask "shottr"
cask "tomighty"
cask "transmission"
cask "visual-studio-code"
cask "xld"
